import numpy as np

# =============================================================================
# a=np.arange(1,101,1)
# a=np.reshape(a,[10,10])
# 
# b=a[3,2]
# c=a[1:4,1]  #rwo: 1~3, col:1을 가져온다.
# d=a[3:6,:]
# =============================================================================

# =============================================================================
# 
# rand_mat=np.random.rand(100,10)*2+1    #1~3 사이 값100,10 선언
# a=rand_mat[:,2]                           #2열 전체를 가져옴
# ind_a=np.where(a>2.5)            #2.5보다 큰값 가져옴(주소로 가져와짐)
# big_a=a[ind_a]                 #위에서 가져온 값을 알려줌
# =============================================================================


a=np.arange(1,7,1)
a=np.reshape(a,[6,1])
b=np.arange(1,7,1)+1
b=np.reshape(b,[6,1])
c=np.arange(1,7,1)+2
c=np.reshape(c,[1,6])

# d=a+c                 #a와 c가 사이즈가 안맞으므로 덧셈 불가능
d=np.dot(np.transpose(a),b)
