
# 1=============================================================================
# print("Hello World1")
# print("Hello World2")
# print("Hello World3")
# print("Hello World4")
# print("Hello World5")
# print(1+1)
# =============================================================================


# 2=============================================================================
# name = "Gil Dong"
# age = 20.
# grade = "A"
# 
# weight = 70.1
# print(name+"'s weight is", weight, "kg")
# weight = weight - 1
# 
# print(name,"'s weight is", weight, "kg") #'s가 떨어져있으므로 +를 이용해 문자열끼리 합쳐서 출력
# print(name+"'s weight is", weight, "kg")
# 
# print(name+"'s weight is", str(weight)+"kg") #weight는 float kg는 문자이므로 숫자 문자는 +불가능 따라서 str이용해서 문자로 변환
# =============================================================================


# =============================================================================
# A=5
# B=4
# 
# print(A<B)
# c=A>B
# =============================================================================



